{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите первую сторону треугольника: 3\n",
      "Введите вторую  сторону треугольника: 4\n",
      "Введите третью сторону треугольника: 5\n",
      "Площадь треугольника равна:  6.0\n"
     ]
    }
   ],
   "source": [
    "import numpy as np\n",
    "st1=int(input('Введите первую сторону треугольника: '))\n",
    "st2=int(input('Введите вторую  сторону треугольника: '))\n",
    "st3=int(input('Введите третью сторону треугольника: '))\n",
    "if st1< 0 or st2< 0 or st3< 0:\n",
    "    while st1< 0 or st2< 0 or st3<0:\n",
    "        print('Все стороны должны быть должны быть больше 0! Попробуйте снова!')\n",
    "        st1=int(input('Введите первую сторону треугольника: '))\n",
    "        st2=int(input('Введите вторую  сторону треугольника: '))\n",
    "        st3=int(input('Введите третью сторону треугольника: '))\n",
    "p_p=(int(st1)+int(st2)+int(st3))/2\n",
    "s=np.sqrt(p_p*(p_p-int(st1))*(p_p-int(st2))*(p_p-int(st3)))\n",
    "print('Площадь треугольника равна: ', s)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "n=17\n",
      "[2, 3, 5, 7, 11, 13, 17]\n"
     ]
    }
   ],
   "source": [
    "#Напишите программу, которая находит все простые числа между 0 и числом, введенным пользователем.\n",
    "n = input(\"n=\")\n",
    "n=int(n)\n",
    "lst=[2]\n",
    "for i in range(3, n+1, 2):\n",
    "    if (i > 10) and (i%10==5):\n",
    "        continue\n",
    "    for j in lst:\n",
    "        if j*j-1 > i:\n",
    "            lst.append(i)\n",
    "            break\n",
    "        if (i % j == 0):\n",
    "            break\n",
    "    else:\n",
    "        lst.append(i)\n",
    "print (lst)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "n=17\n",
      "[2, 3, 5, 7, 11, 13, 17]\n"
     ]
    }
   ],
   "source": [
    "#Решето Эратосфена:\n",
    "n = input(\"n=\")\n",
    "n=int(n)\n",
    "a = [i for i in range(0,n+1)]\n",
    "a[1] = 0\n",
    "lst = []\n",
    "\n",
    "i = 2\n",
    "while i <= n:\n",
    "    if a[i] != 0:\n",
    "        lst.append(a[i])\n",
    "        for j in range(i, n+1, i):\n",
    "            a[j] = 0\n",
    "    i += 1\n",
    "print (lst)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите начальное число:3\n",
      "Введите конечное число:16\n",
      "[5, 10, 15]\n"
     ]
    }
   ],
   "source": [
    "#Напишите программу, которая выводит все кратные 5 числа между двумя числами, введенные пользоватем.\n",
    "start=input(\"Введите начальное число:\")\n",
    "end=input(\"Введите конечное число:\")\n",
    "start=int(start)\n",
    "end=int(end)\n",
    "lst=[]\n",
    "for i in range(start, end+1):\n",
    "    if i % 5 == 0:\n",
    "        lst.append(i)\n",
    "print(lst)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите начальное число:3\n",
      "Введите конечное число:16\n",
      "5\n",
      "[5, 10, 15]\n"
     ]
    }
   ],
   "source": [
    "#Напишите программу, которая выводит все кратные 5 числа между двумя числами, введенные пользоватем.\n",
    "#идея:найти первое кратное, прибавлять к нему 5, до тех пор, пока оно меньше конечного\n",
    "start=input(\"Введите начальное число:\")\n",
    "end=input(\"Введите конечное число:\")\n",
    "start=int(start)\n",
    "end=int(end)\n",
    "lst=[]\n",
    "k=1\n",
    "while k % 5 !=0:\n",
    "    k=k+1\n",
    "print(k)\n",
    "lst.append(k)\n",
    "while (k+5)<end:\n",
    "    k=k+5\n",
    "    lst.append(k)\n",
    "print(lst)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите число a:1\n",
      "Введите число b:0\n",
      "Введите число c:-9\n",
      "x1= 3.0\n",
      "x2= -3.0\n"
     ]
    }
   ],
   "source": [
    "#Напишите программу, которая спрашивает пользователя три числа (a, b, c), выдает решение квадратного уравнения. Или пишет, что решения нет.\n",
    "a=input(\"Введите число a:\")\n",
    "b=input(\"Введите число b:\")\n",
    "c=input(\"Введите число c:\")\n",
    "a=int(a)\n",
    "b=int(b)\n",
    "c=int(c)\n",
    "if a != 0:\n",
    "    diskr=b*b-4*a*c\n",
    "    if diskr>=0:\n",
    "        print('x1=', (b +np.sqrt(diskr))/(2*a))\n",
    "        print('x2=', (b -np.sqrt(diskr))/(2*a))\n",
    "    else:\n",
    "        print('Нет решений')\n",
    "if a == 0 and b != 0:\n",
    "    print('x=',-c/b)\n",
    "if a == 0 and b == 0:\n",
    "    print('Не уравнение')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Средняя сумма долга: 1081.0\n",
      "Дисперсия: 1406229.0\n",
      "Сумма долга:  10810\n",
      "Максимальная сумма долга: Henry 4500\n",
      "Минимальная сумма долга: Linkoln 280\n",
      "Ближе всего к среднему:  Joe 1000  c отклонением  81.0\n"
     ]
    }
   ],
   "source": [
    "## Дан словарь из 10 ключ-значений вида: имя: сумма долга в рублях.\n",
    "#Посчитайте и выведите: среднюю сумму долга, абсолютную сумму долга, \n",
    "#дисперсию долга. Найдите и выведите: имя человека с максимальным \n",
    "#и минимальным долгом, имя человека с долгом, который ближе всего по значению к среднему.7\n",
    "dolg={'Joe': 1000, 'John': 500, 'Peter':400, 'Walter': 340, 'Olivia': 770, 'Linkoln':280, 'Philipp': 930, 'Nick': 690, \n",
    "     'William': 1400, 'Henry': 4500}\n",
    "vals=list(dolg.values())\n",
    "def get_key(d, value):\n",
    "    for k, v in d.items():\n",
    "        if v == value:\n",
    "            return k\n",
    "otkl=100000\n",
    "zn=0\n",
    "for i in vals:\n",
    "    if otkl>abs(np.mean(vals)-i):\n",
    "        otkl=abs(np.mean(vals)-i)\n",
    "        zn=i\n",
    "print('Средняя сумма долга:',np.mean(vals))\n",
    "print('Дисперсия:',np.var(vals))\n",
    "print('Сумма долга: ',sum(vals))\n",
    "print('Максимальная сумма долга:',get_key(dolg, max(vals)),  max(vals))\n",
    "print('Минимальная сумма долга:',get_key(dolg, min(vals)), min(vals))\n",
    "print('Ближе всего к среднему: ',get_key(dolg, zn),  zn, ' c отклонением ', otkl)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
